// Це статичний клас для всіх кімнат, пасовищ, тварин і циклу день/ніч. 
namespace Suitcase
{
    public static class Case
    {
        public static Room room = new Room();          // Взагалі то це список. Ми могли б використовувати нормальні списки і цикл 
        public static Pasture pasture = new Pasture(); // foreach, але ми мусили використати паттерн "Ланцюжок обов'язків".
        public static DayTime dayTime = new Day();
    }
}
//В принципі, це можна переробити в справжні списки, для цього треба будеперенести всю логіку з Habitat і підклассів
// в Biologist, де доведеться зробити її заново через цикли і без ланцюжка обов'язків.
// АБО можна спробувати зберегти логіку ланцюжка і використовувати списки і foreach для всього іншого! Ми спробуємо зробити це самі.